Masmiseim36/Kinetis/targets/Kinetis/SVD/MK20N512MD100.svd.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
  <name>MK20N512MD100</name>
  <version>1.1</version>
  <description>MK20N512MD100 - ARM Cortex-M4 based Freescale Microcontroller</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>FTFL_FlashConfig</name>
      <description>Flash Memory Interface</description>
      <prependToName>NV_</prependToName>
      <baseAddress>0x400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BACKKEY3</name>
          <description>Backdoor Comparison Key 3.</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY2</name>
          <description>Backdoor Comparison Key 2.</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY1</name>
          <description>Backdoor Comparison Key 1.</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY0</name>
          <description>Backdoor Comparison Key 0.</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY7</name>
          <description>Backdoor Comparison Key 7.</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY6</name>
          <description>Backdoor Comparison Key 6.</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY5</name>
          <description>Backdoor Comparison Key 5.</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKKEY4</name>
          <description>Backdoor Comparison Key 4.</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Backdoor Comparison Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPROT3</name>
          <description>Non-volatile P-Flash Protection 1 - Low Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>P-Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPROT2</name>
          <description>Non-volatile P-Flash Protection 1 - High Register</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>P-Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPROT1</name>
          <description>Non-volatile P-Flash Protection 0 - Low Register</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>P-Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPROT0</name>
          <description>Non-volatile P-Flash Protection 0 - High Register</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>P-Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEC</name>
          <description>Non-volatile Flash Security Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SEC</name>
              <description>Flash Security</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSLACC</name>
              <description>Freescale Failure Analysis Access Code</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEEN</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEYEN</name>
              <description>Backdoor Key Security Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FOPT</name>
          <description>Non-volatile Flash Option Register</description>
          <addressOffset>0xD</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LPBOOT</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EZPORT_DIS</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEPROT</name>
          <description>Non-volatile EERAM Protection Register</description>
          <addressOffset>0xE</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>EPROT</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDPROT</name>
          <description>Non-volatile D-Flash Protection Register</description>
          <addressOffset>0xF</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DPROT</name>
              <description>D-Flash Region Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
